app/controllers/albums_controller.rb

  def show
    @album = Album.find(params[:id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 0)

  def edit
    @artists = Artist.find(:all)
    @features = Feature.find(:all)
    @album = Album.find(params[:id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 7)