app/controllers/artists_controller.rb

SELECT * FROM `artists` WHERE (`artists`.`id` = 0)
---
  def show
    @artist = Artist.find(params[:id])