app/controllers/public_controller.rb

  def show
    @album = Album.find(params['id'])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 3)

  def edit
    @album = Album.find(params[:id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 3)